app/Controllers/Customer/Dashboard.php

SELECT *
FROM `buku`
ORDER BY `judul` ASC
---
    public function index()
    {
        $keyword  = $this->request->getGet('q');
        $kategori = $this->request->getGet('kategori');

        $query = $this->bukuModel;

        if ($keyword) {
            $query = $query->groupStart()
                ->like('judul', $keyword)
                ->orLike('kode_buku', $keyword)
                ->orLike('pengarang', $keyword)
                ->groupEnd();
        }

        if ($kategori) {
            $query = $query->where('kategori', $kategori);
        }

        $data['buku']          = $query->orderBy('judul', 'ASC')->findAll();