app/Controllers/Admin/Anggota.php

    public function index()
    {
        $keyword = $this->request->getGet('q');

        if ($keyword) {
            $data['anggota'] = $this->anggotaModel->like('nama', $keyword)
                ->orLike('nis_nim', $keyword)
                ->findAll();
        } else {
            $data['anggota'] = $this->anggotaModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `anggota`
ORDER BY `id` DESC