app/Controllers/Admin/Dashboard.php

    public function index()
    {
        $bukuModel    = new BukuModel();
        $anggotaModel = new AnggotaModel();

        $data['title']            = 'Dashboard Admin';
        $data['total_buku']       = $bukuModel->countAll();
        $data['total_anggota']    = $anggotaModel->countAll();
        $data['total_dipinjam']   = $bukuModel->where('status', 'dipinjam')->countAllResults();
        $data['buku_terbaru']     = $bukuModel->orderBy('id', 'DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows` FROM `buku`
SELECT COUNT(*) AS `numrows` FROM `anggota`
SELECT COUNT(*) AS `numrows`
FROM `buku`
WHERE `status` = 'dipinjam'
SELECT *
FROM `buku`
ORDER BY `id` DESC
 LIMIT 5