app/Models/AnggotaModel.php

    public function findByNisNim(string $nisNim): ?array
    {
        return $this->where('nis_nim', $nisNim)->first();
---
SELECT *
FROM `anggota`
WHERE `nis_nim` = '2023001'
 LIMIT 1