app/Models/BukuModel.php

SELECT *
FROM `buku`
WHERE `buku`.`id` = 2
UPDATE `buku` SET `status` = 'dipinjam', `anggota_id` = 1, `tanggal_pinjam` = '2026-07-28 08:55:13', `stok` = 4, `updated_at` = '2026-07-28 08:55:13'
WHERE `buku`.`id` IN (2)
---
    public function pinjamBuku(int $idBuku, int $idAnggota): bool
    {
        $buku = $this->find($idBuku);

        if (! $buku || $buku['status'] === 'dipinjam' || $buku['stok'] < 1) {
            return false;
        }

        return (bool) $this->update($idBuku, [
            'status'         => 'dipinjam',
            'anggota_id'     => $idAnggota,
            'tanggal_pinjam' => date('Y-m-d H:i:s'),
            'stok'           => $buku['stok'] - 1,
        ]);

SELECT *
FROM `buku`
WHERE `anggota_id` = 1
AND `status` = 'dipinjam'
---
    public function pinjamanAnggota(int $idAnggota): array
    {
        return $this->where('anggota_id', $idAnggota)
            ->where('status', 'dipinjam')
            ->findAll();